if __name__ == '__main__':
    print("Введите 4 числа, не превозходящих 8: ")
    k = int(input("1 число: "))
    l = int(input("2 число: "))
    m = int(input("3 число: "))
    n = int(input("4 число: "))

    #а)
    if ((k % 2 == 0)&(l % 2 != 0)&(m % 2 == 0)&(n % 2 != 0)) | ((k % 2 == 0)&(l % 2 != 0)&(m % 2 != 0)&(n % 2 == 0)) | ((k % 2 != 0)&(l % 2 == 0)&(m % 2 != 0)&(n % 2 == 0)) | ((k % 2 != 0)&(l % 2 == 0)&(m % 2 != 0)&(n % 2 == 0)):
        print("а) Клетки белого цвета")
    elif ((k % 2 == 0)&(l % 2 == 0)&(m % 2 == 0)&(n % 2 == 0)) | ((k % 2 == 0)&(l % 2 == 0)&(m % 2 != 0)&(n % 2 != 0)) | ((k % 2 != 0)&(l % 2 != 0)&(m % 2 == 0)&(n % 2 == 0)) | ((k % 2 != 0)&(l % 2 != 0)&(m % 2 != 0)&(n % 2 != 0)):
        print("а) Клетки черного цвета")
    else:
        print("а) Разного цвета")

    #б)
    if (k == m)|(l == n)|(abs(k - m) == abs(l - n)):
        print("б) Угрожает")
    else:
        print("б) Не угражает")

    #в)
    if ((k+1 == m)&(l+2 == n))|((k+2 == m)&(l+1 == n))|((k+2 == m)&(l-1 == n))|((k+1 == m)&(l-2 == n))|((k-1 == m)&(l-2 == n))|((k-2 == m)&(l-1 == n))|((k-2 == m)&(l+1 == n))|((k-1 == m)&(l+2 == n)):
        print("в) Угрожает")
    else:
        print("в) Не угрожает")

    #г)
    if (k == m)|(l == n):
        print("г) Можно за 1 ход")
    else:
        print("г) Можно за 2 хода, первый ход на поле (", m, ", ", l, ")")

    #д)
    if (k == m)|(l == n)|(abs(k - m) == abs(l - n)):
        print("д) Можно за один ход")
    else:
        print("д) Можно за 2 хода, первый ход на поле (", m, ", ", l, ")")





